# Brew is used to install only packages that are meant to
# bring MacOS to the same level of features as what a Linux
# distribution would have
#
# For development tools, packages are installed through mise


# Shell Tools
brew "bash"
brew "bat"
brew "catimg"
brew "coreutils"
brew "ed"
brew "eza"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gettext"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gpg"
brew "htop"
brew "make"
brew "neovim"
brew "tmux"
brew "tree"
brew "vivid"
brew "watch"
brew "wget"
brew "zoxide"

# tools
brew "borgbackup/tap/borgbackup-fuse"
brew "mise"
brew "pre-commit"

# Graphical Tools
cask "alacritty"
cask "keepassxc"
cask "macfuse"
cask "mos"

# Fonts
cask "font-sauce-code-pro-nerd-font"
cask "font-comfortaa"
cask "font-noto-color-emoji"
